
//  Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Enter number: ");
int number = Convert.ToInt32(Console.ReadLine());
int[] array = new int[];

if (number > 99)
{
    int count = 0;
    position = number;
    while (count < position)
    {
     //   array[count] = position;
    }

}

